[
{"title": "<h2 class=\"jsx-3509540955 title\">Trump-linked crypto project buys million-dollar digital tokens</h2>", "news_content": "World Liberty Financial, a crypto project linked to the Trump family, has bought millions of dollars worth of specialized digital tokens.\nThese purchases coincide with the impending launch of the decentralized finance (DeFi) platform.\nFirst announced in September, World Liberty Financial aims to offer lending and trading services through blockchain technology.\nInitially, the project faced challenges in fundraising until crypto entrepreneur Justin Sun contributed US$30 million."},
{"title": "<h2 class=\"jsx-3509540955 title\">Israel launches $1.8m AI expert recruitment program</h2>", "news_content": "The Israel Innovation Authority has introduced pilot programs designed to address the global shortage of AI professionals.\nWith a budget of 7 million Israeli shekels (approximately US$1.8 million), the initiative aims to recruit 200 AI experts for Israeli startups over the next three years.\nAs part of Israel’s National AI Program, the effort will target highly skilled talent, including foreign professionals, returning Israeli citizens, and individuals eligible under the Law of Return.\nOrganizations like Nish Hitech, Gvahim in partnership with The Jewish Agency, and ScienceAbroad in collaboration with Nefesh B’Nefesh will manage recruitment, placement, and integration processes."},
{"title": "<h2 class=\"jsx-3509540955 title\">Dubai proptech startup Stake considers Saudi HQ</h2>", "news_content": "Stake, a United Arab Emirates-based real estate investment platform, is considering moving its regional headquarters to Saudi Arabia.\nAccording to Hanouf Bin Saeed, general manager of Stake Saudi Arabia, no timeline has been set for the relocation.\nThis move aligns with the company’s strategy to expand within the Kingdom’s growing real estate market.\nThe company officially launched operations in Saudi Arabia on December 9."},
{"title": "<h2 class=\"jsx-3509540955 title\">TSMC to boost AI-driven foundry market share to 66% by 2025</h2>", "news_content": "Taiwan Semiconductor Manufacturing Co. (TSMC) is expected to boost its share of the pure-play foundry market from 64% to 66% by 2025.\nThis prediction comes from a report by International Data Corp. (IDC) amid anticipated 15% growth in the global integrated circuit (IC) market, driven by demand for AI applications and high-performance computing.\nIn 2023, TSMC held a 59% share of the traditional Foundry 1.0 market, which pertains to conventional pure-play wafer foundry operations.\nIDC foresees that TSMC’s position in the Foundry 2.0 market will strengthen throughout 2024 and 2025, fueled by increasing demand from advancements in AI."},
{"title": "<h2 class=\"jsx-3509540955 title\">Indian wealth management firm buys $12m Oyo shares</h2>", "news_content": "Oyo’s valuation is at US$4.6 billion after Nuvama Wealth bought 100 crore rupees (US$12 million) worth of shares in Oyo’s parent, Oravel Stays Ltd.\nThe shares were priced at 53 crore rupees (US$6.63 million) per share in a recent secondary transaction.\nThis valuation marks a notable decline from Oyo’s peak valuation of US$10 billion.\nOyo also announced the acquisition of G6 Hospitality, the parent company of Motel 6 and Studio 6 brands, from Blackstone Real Estate for US$525 million in an all-cash deal."},
{"title": "<h2 class=\"jsx-3509540955 title\">Trump proposes nat’l bitcoin reserve, prices hit record high</h2>", "news_content": "Bitcoin prices hit a record high of US$106,533 on Monday in Asia, as United States President-elect Donald Trump proposed a national cryptocurrency reserve.\nMeanwhile, ether rose nearly 3% to US$4,014.\nTrump’s idea for a bitcoin reserve aims to strengthen the country’s global leadership in crypto, while other countries, like Russia, consider alternatives to foreign currencies.\nFederal Reserve Chair Jerome Powell has expressed skepticism. He compared bitcoin to gold, discussing its volatility and questioning its viability as a stable payment method or store of value.\nBitcoin’s price surge follows momentum since the US elections in November, where several pro-crypto candidates, including Trump, won.\nThe total cryptocurrency market valuation has nearly doubled in 2024, surpassing US$3.8 trillion, according to CoinGecko."},
{"title": "<h2 class=\"jsx-3509540955 title\">Trump’s tech advisors cautious about AI</h2>", "news_content": "President-elect Donald Trump has enlisted Silicon Valley figures like Elon Musk, Marc Andreessen, and David Sacks as tech advisors.\nA key focus is AI censorship, which involves moderating AI-generated responses that may be adjusted to fit specific political views or corporate interests.\nCritics argue this practice can suppress a range of perspectives, echoing earlier concerns about tech companies’ content moderation on social media and digital platforms.\nAndreessen, co-founder of the venture capital firm Andreessen Horowitz, warns that AI could threaten free speech more than earlier tech platforms.\nSacks, the former COO of PayPal and a current tech entrepreneur, has accused firms like Google and OpenAI of embedding partisan biases in their tools.\nRecently appointed as an advisor to Trump on AI and cryptocurrency, Sacks remarked that early versions of AI chatbots, including ChatGPT, were “programmed to be politically correct.”"},
{"title": "<h2 class=\"jsx-3509540955 title\">China’s chip industry six years behind TSMC: author</h2>", "news_content": "China’s semiconductor manufacturing capabilities are approximately six years behind those of Taiwan Semiconductor Manufacturing Co. (TSMC), according to Chris Miller, a technology historian and author of Chip War.\nTSMC’s advanced chips operate up to eight times more efficiently than those from SMIC.\nMiller pointed out that Huawei’s latest smartphone uses chips produced by Semiconductor Manufacturing International Corporation (SMIC), China’s top chipmaker.\nThese chips are manufactured with technology that TSMC developed around 2018.\nThis disparity is partly due to advancements described by Moore’s Law, formulated by Intel co-founder Gordon Moore."},
{"title": "<h2 class=\"jsx-3509540955 title\">Google Cloud launches AI agents platform for businesses</h2>", "news_content": "Google Cloud has launched Google Agentspace, an AI platform aimed at improving enterprise operations through the integration of AI agents, enhanced search capabilities, and organizational data.\nThe service seeks to simplify tasks such as data research and content generation with a streamlined prompt system.\nGoogle Agentspace includes features designed to enhance productivity.\nThe platform emphasizes security by utilizing Google Cloud’s infrastructure and providing IT controls, such as role-based access and identity management."},
{"title": "<h2 class=\"jsx-3509540955 title\">Zerodha reports 37.2% revenue rise to $1.13b</h2>", "news_content": "Zerodha reported a 37.2% increase in its consolidated revenue for the financial year 2024, reaching 9,372.1 crore rupees (US$1.13 billion), up from 6,832.8 crore rupees (US$820 million) in the previous year.\nIncluding other income of 622.3 crore rupees (US$75 million), the Bengaluru-based company’s total income rose to 9,994.5 crore rupees (US$1.2 billion).\nFounded in 2010 by Nithin and Nikhil Kamath, Zerodha generates revenue through brokerage sales, user onboarding fees, and technology products like its Kite Connect API.\nThe company’s total assets under management reached 5.66 crore rupees (US$68 billion) earlier this year."},
{"title": "<h2 class=\"jsx-3509540955 title\">TikTok Shop surpasses Shein, Sephora in US spending</h2>", "news_content": "TikTok Shop has surpassed major online retailers such as Shein and Sephora in consumer spending in the US during the third quarter of 2024.\nThe report analyzed data from 11 surveys with over 3,000 consumers and noted TikTok Shop’s growth since its launch in September 2023.\nIt found that 80% of Americans who use TikTok monthly are aware of its shopping feature.\nFurthermore, 45% of TikTok users reported buying fashion and accessories. Meanwhile, 44% purchased beauty and personal care items."},
{"title": "<h2 class=\"jsx-3509540955 title\">US-based PE firm acquires Israeli cybersecurity startup</h2>", "news_content": "United States-based private equity firm AE Industrial Partners has acquired Paragon, an Israeli cybersecurity firm specializing in offensive technology.\nThe deal is worth US$500 million upfront, with the total potentially reaching US$900 million based on future performance milestones.\nAE Industrial Partners plans to merge Paragon with its existing portfolio company, Red Lattice, to enhance its presence in the defense technology sector.\nThe acquisition required regulatory approval from US authorities and Israel’s Ministry of Defense due to the sensitive nature of Paragon’s technology."},
{"title": "<h2 class=\"jsx-3509540955 title\">Xiaohongshu grows for luxury goods in social ecommerce</h2>", "news_content": "Xiaohongshu, a Chinese social media platform similar to Instagram, is gaining traction as an ecommerce channel for high-end and niche brands.\nThe platform’s integration of livestream ecommerce and a conversational influencer approach stands in contrast to the more aggressive sales tactics used on platforms like Alibaba’s Taobao and ByteDance’s Douyin.\nLuxury brands, such as Coach and L’Oreal, are increasingly using Xiaohongshu.\nSome brands open stores directly on the platform, while others partner with influencers for livestream events showcasing various products."},
{"title": "<h2 class=\"jsx-3509540955 title\">Google names Preeti Lobana as new India chief</h2>", "news_content": "Google has appointed Preeti Lobana as the head of its India business, a position that has been vacant since July.\nShe takes over from Sanjay Gupta, who has been promoted to president for the Asia-Pacific region.\nLobana joined Google in 2016 and has prior banking experience from NatWest, American Express, and Standard Chartered.\nRoma Datta Chobey, who acted as interim lead, will now return to oversee Google’s digital business unit in India."},
{"title": "<h2 class=\"jsx-3509540955 title\">India’s AI-powered accounting startup raises $5m</h2>", "news_content": "India’s SaaS-based accounting startup HostBooks has raised US$5 million in funding from Orange Orbit LLP as part of a US$15 million Series B funding round.\nThe first tranche of US$2.5 million was disbursed earlier in this round.\nThe company plans to use the funds to expand its AI-driven product offerings, improve its global reach, and strengthen its sales, marketing, and operations teams.\nFounded in 2009 by Kapil Rana, HostBooks provides cloud-based solutions for businesses facing compliance, accounting, finance, and operational issues.\nThe company also uses AI and machine learning to enhance operational controls."}
]